podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MK52D10.svd.xml
            <register>
               <name>FCFG1</name>
               <description>Flash Configuration Register 1</description>
               <addressOffset>0x104C</addressOffset>
               <resetValue>0xFF0F0F00</resetValue>
               <fields>
                  <field>
                     <name>FLASHDIS</name>
                     <description>Flash Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Flash is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Flash is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLASHDOZE</name>
                     <description>Flash Doze</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Flash remains enabled during Wait mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Flash is disabled for the duration of Wait mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DEPART</name>
                     <description>FlexNVM partition</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EESIZE</name>
                     <description>EEPROM size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>Reserved</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Reserved</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>4 KB</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>1 KB</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>512 Bytes</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>256 Bytes</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>128 Bytes</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>64 Bytes</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>32 Bytes</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>0 Bytes</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFSIZE</name>
                     <description>Program Flash Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>128 KB of program flash, 4 KB protection region</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>256 KB of program flash, 8 KB protection region</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>512 KB of program flash, 16 KB protection region</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NVMSIZE</name>
                     <description>FlexNVM size</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>0 KB of FlexNVM</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>128 KB of FlexNVM, 32 KB protection region</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>256 KB of FlexNVM, 32 KB protection region</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG2</name>
               <description>Flash Configuration Register 2</description>
               <addressOffset>0x1050</addressOffset>
               <access>read-only</access>
               <resetValue>0x7F7F0000</resetValue>
               <fields>
                  <field>
                     <name>MAXADDR1</name>
                     <description>Max address block 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PFLSH</name>
                     <description>Program flash</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Reserved for devices without FlexNVM</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Physical flash block 1 is used as program flash</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAXADDR0</name>
                     <description>Max address block 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SWAPPFLSH</name>
                     <description>Swap program flash</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Swap is not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Swap is active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDH</name>
               <description>Unique Identification Register High</description>
               <addressOffset>0x1054</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDMH</name>
               <description>Unique Identification Register Mid-High</description>
               <addressOffset>0x1058</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDML</name>
               <description>Unique Identification Register Mid Low</description>
               <addressOffset>0x105C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDL</name>
               <description>Unique Identification Register Low</description>
               <addressOffset>0x1060</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
